#include "utils.hpp"
using namespace std;

/*
颠倒给定的 32 位无符号整数的二进制位。

示例 1：

输入: 00000010100101000001111010011100
输出: 00111001011110000010100101000000
解释: 输入的二进制串 00000010100101000001111010011100 表示无符号整数 43261596，
     因此返回 964176192，其二进制表示形式为 00111001011110000010100101000000。
*/

class Solution {
public:
    uint32_t reverseBits(uint32_t n) {
        int res = 0, p = 31;
        while (n) {
            res |= (n & 1) << p;  // n & 1 取出最底位，<< p 移动到指定的位置然后与之前结果 取或
            n >>= 1;
            --p;
        }
        return res;
    }
};
